Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME70_DFP/4.3.73/same70a/include/component/mcan.h
/**
 * \brief Component description for MCAN
 *
 * Copyright (c) 2020 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2017-08-25T14:00:00Z */
#ifndef _SAME70_MCAN_COMPONENT_H_
#define _SAME70_MCAN_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR MCAN                                         */
/* ************************************************************************** */

/* -------- MCAN_CUST : (MCAN Offset: 0x08) (R/W 32) Customer Register -------- */
#define MCAN_CUST_CSV_Pos                     _U_(0)                                               /**< (MCAN_CUST) Customer-specific Value Position */
#define MCAN_CUST_CSV_Msk                     (_U_(0xFFFFFFFF) << MCAN_CUST_CSV_Pos)               /**< (MCAN_CUST) Customer-specific Value Mask */
#define MCAN_CUST_CSV(value)                  (MCAN_CUST_CSV_Msk & ((value) << MCAN_CUST_CSV_Pos))
#define MCAN_CUST_Msk                         _U_(0xFFFFFFFF)                                      /**< (MCAN_CUST) Register Mask  */


/* -------- MCAN_FBTP : (MCAN Offset: 0x0C) (R/W 32) Fast Bit Timing and Prescaler Register -------- */
#define MCAN_FBTP_FSJW_Pos                    _U_(0)                                               /**< (MCAN_FBTP) Fast (Re) Synchronization Jump Width Position */
#define MCAN_FBTP_FSJW_Msk                    (_U_(0x3) << MCAN_FBTP_FSJW_Pos)                     /**< (MCAN_FBTP) Fast (Re) Synchronization Jump Width Mask */
#define MCAN_FBTP_FSJW(value)                 (MCAN_FBTP_FSJW_Msk & ((value) << MCAN_FBTP_FSJW_Pos))
#define MCAN_FBTP_FTSEG2_Pos                  _U_(4)                                               /**< (MCAN_FBTP) Fast Time Segment After Sample Point Position */
#define MCAN_FBTP_FTSEG2_Msk                  (_U_(0x7) << MCAN_FBTP_FTSEG2_Pos)                   /**< (MCAN_FBTP) Fast Time Segment After Sample Point Mask */
#define MCAN_FBTP_FTSEG2(value)               (MCAN_FBTP_FTSEG2_Msk & ((value) << MCAN_FBTP_FTSEG2_Pos))
#define MCAN_FBTP_FTSEG1_Pos                  _U_(8)                                               /**< (MCAN_FBTP) Fast Time Segment Before Sample Point Position */
#define MCAN_FBTP_FTSEG1_Msk                  (_U_(0xF) << MCAN_FBTP_FTSEG1_Pos)                   /**< (MCAN_FBTP) Fast Time Segment Before Sample Point Mask */
#define MCAN_FBTP_FTSEG1(value)               (MCAN_FBTP_FTSEG1_Msk & ((value) << MCAN_FBTP_FTSEG1_Pos))
#define MCAN_FBTP_FBRP_Pos                    _U_(16)                                              /**< (MCAN_FBTP) Fast Baud Rate Prescaler Position */
#define MCAN_FBTP_FBRP_Msk                    (_U_(0x1F) << MCAN_FBTP_FBRP_Pos)                    /**< (MCAN_FBTP) Fast Baud Rate Prescaler Mask */
#define MCAN_FBTP_FBRP(value)                 (MCAN_FBTP_FBRP_Msk & ((value) << MCAN_FBTP_FBRP_Pos))
#define MCAN_FBTP_TDC_Pos                     _U_(23)                                              /**< (MCAN_FBTP) Transceiver Delay Compensation Position */
#define MCAN_FBTP_TDC_Msk                     (_U_(0x1) << MCAN_FBTP_TDC_Pos)                      /**< (MCAN_FBTP) Transceiver Delay Compensation Mask */
#define MCAN_FBTP_TDC(value)                  (MCAN_FBTP_TDC_Msk & ((value) << MCAN_FBTP_TDC_Pos))
#define   MCAN_FBTP_TDC_DISABLED_Val          _U_(0x0)                                             /**< (MCAN_FBTP) Transceiver Delay Compensation disabled.  */
#define   MCAN_FBTP_TDC_ENABLED_Val           _U_(0x1)                                             /**< (MCAN_FBTP) Transceiver Delay Compensation enabled.  */
#define MCAN_FBTP_TDC_DISABLED                (MCAN_FBTP_TDC_DISABLED_Val << MCAN_FBTP_TDC_Pos)    /**< (MCAN_FBTP) Transceiver Delay Compensation disabled. Position  */
#define MCAN_FBTP_TDC_ENABLED                 (MCAN_FBTP_TDC_ENABLED_Val << MCAN_FBTP_TDC_Pos)     /**< (MCAN_FBTP) Transceiver Delay Compensation enabled. Position  */
#define MCAN_FBTP_TDCO_Pos                    _U_(24)                                              /**< (MCAN_FBTP) Transceiver Delay Compensation Offset Position */
#define MCAN_FBTP_TDCO_Msk                    (_U_(0x1F) << MCAN_FBTP_TDCO_Pos)                    /**< (MCAN_FBTP) Transceiver Delay Compensation Offset Mask */
#define MCAN_FBTP_TDCO(value)                 (MCAN_FBTP_TDCO_Msk & ((value) << MCAN_FBTP_TDCO_Pos))
#define MCAN_FBTP_Msk                         _U_(0x1F9F0F73)                                      /**< (MCAN_FBTP) Register Mask  */


/* -------- MCAN_TEST : (MCAN Offset: 0x10) (R/W 32) Test Register -------- */
#define MCAN_TEST_LBCK_Pos                    _U_(4)                                               /**< (MCAN_TEST) Loop Back Mode (read/write) Position */
#define MCAN_TEST_LBCK_Msk                    (_U_(0x1) << MCAN_TEST_LBCK_Pos)                     /**< (MCAN_TEST) Loop Back Mode (read/write) Mask */
#define MCAN_TEST_LBCK(value)                 (MCAN_TEST_LBCK_Msk & ((value) << MCAN_TEST_LBCK_Pos))
#define   MCAN_TEST_LBCK_DISABLED_Val         _U_(0x0)                                             /**< (MCAN_TEST) Reset value. Loop Back mode is disabled.  */
#define   MCAN_TEST_LBCK_ENABLED_Val          _U_(0x1)                                             /**< (MCAN_TEST) Loop Back mode is enabled (see Section 1.5.1.9).  */
#define MCAN_TEST_LBCK_DISABLED               (MCAN_TEST_LBCK_DISABLED_Val << MCAN_TEST_LBCK_Pos)  /**< (MCAN_TEST) Reset value. Loop Back mode is disabled. Position  */
#define MCAN_TEST_LBCK_ENABLED                (MCAN_TEST_LBCK_ENABLED_Val << MCAN_TEST_LBCK_Pos)   /**< (MCAN_TEST) Loop Back mode is enabled (see Section 1.5.1.9). Position  */
#define MCAN_TEST_TX_Pos                      _U_(5)                                               /**< (MCAN_TEST) Control of Transmit Pin (read/write) Position */
#define MCAN_TEST_TX_Msk                      (_U_(0x3) << MCAN_TEST_TX_Pos)                       /**< (MCAN_TEST) Control of Transmit Pin (read/write) Mask */
#define MCAN_TEST_TX(value)                   (MCAN_TEST_TX_Msk & ((value) << MCAN_TEST_TX_Pos))  
#define   MCAN_TEST_TX_RESET_Val              _U_(0x0)                                             /**< (MCAN_TEST) Reset value, CANTX controlled by the CAN Core, updated at the end of the CAN bit time.  */
#define   MCAN_TEST_TX_SAMPLE_POINT_MONITORING_Val _U_(0x1)                                             /**< (MCAN_TEST) Sample Point can be monitored at pin CANTX.  */
#define   MCAN_TEST_TX_DOMINANT_Val           _U_(0x2)                                             /**< (MCAN_TEST) Dominant ('0') level at pin CANTX.  */
#define   MCAN_TEST_TX_RECESSIVE_Val          _U_(0x3)                                             /**< (MCAN_TEST) Recessive ('1') at pin CANTX.  */
#define MCAN_TEST_TX_RESET                    (MCAN_TEST_TX_RESET_Val << MCAN_TEST_TX_Pos)         /**< (MCAN_TEST) Reset value, CANTX controlled by the CAN Core, updated at the end of the CAN bit time. Position  */
#define MCAN_TEST_TX_SAMPLE_POINT_MONITORING  (MCAN_TEST_TX_SAMPLE_POINT_MONITORING_Val << MCAN_TEST_TX_Pos) /**< (MCAN_TEST) Sample Point can be monitored at pin CANTX. Position  */
#define MCAN_TEST_TX_DOMINANT                 (MCAN_TEST_TX_DOMINANT_Val << MCAN_TEST_TX_Pos)      /**< (MCAN_TEST) Dominant ('0') level at pin CANTX. Position  */
#define MCAN_TEST_TX_RECESSIVE                (MCAN_TEST_TX_RECESSIVE_Val << MCAN_TEST_TX_Pos)     /**< (MCAN_TEST) Recessive ('1') at pin CANTX. Position  */
#define MCAN_TEST_RX_Pos                      _U_(7)                                               /**< (MCAN_TEST) Receive Pin (read-only) Position */
#define MCAN_TEST_RX_Msk                      (_U_(0x1) << MCAN_TEST_RX_Pos)                       /**< (MCAN_TEST) Receive Pin (read-only) Mask */
#define MCAN_TEST_RX(value)                   (MCAN_TEST_RX_Msk & ((value) << MCAN_TEST_RX_Pos))  
#define MCAN_TEST_TDCV_Pos                    _U_(8)                                               /**< (MCAN_TEST) Transceiver Delay Compensation Value (read-only) Position */
#define MCAN_TEST_TDCV_Msk                    (_U_(0x3F) << MCAN_TEST_TDCV_Pos)                    /**< (MCAN_TEST) Transceiver Delay Compensation Value (read-only) Mask */
#define MCAN_TEST_TDCV(value)                 (MCAN_TEST_TDCV_Msk & ((value) << MCAN_TEST_TDCV_Pos))
#define MCAN_TEST_Msk                         _U_(0x00003FF0)                                      /**< (MCAN_TEST) Register Mask  */


/* -------- MCAN_RWD : (MCAN Offset: 0x14) (R/W 32) RAM Watchdog Register -------- */
#define MCAN_RWD_WDC_Pos                      _U_(0)                                               /**< (MCAN_RWD) Watchdog Configuration (read/write) Position */
#define MCAN_RWD_WDC_Msk                      (_U_(0xFF) << MCAN_RWD_WDC_Pos)                      /**< (MCAN_RWD) Watchdog Configuration (read/write) Mask */
#define MCAN_RWD_WDC(value)                   (MCAN_RWD_WDC_Msk & ((value) << MCAN_RWD_WDC_Pos))  
#define MCAN_RWD_WDV_Pos                      _U_(8)                                               /**< (MCAN_RWD) Watchdog Value (read-only) Position */
#define MCAN_RWD_WDV_Msk                      (_U_(0xFF) << MCAN_RWD_WDV_Pos)                      /**< (MCAN_RWD) Watchdog Value (read-only) Mask */
#define MCAN_RWD_WDV(value)                   (MCAN_RWD_WDV_Msk & ((value) << MCAN_RWD_WDV_Pos))  
#define MCAN_RWD_Msk                          _U_(0x0000FFFF)                                      /**< (MCAN_RWD) Register Mask  */


/* -------- MCAN_CCCR : (MCAN Offset: 0x18) (R/W 32) CC Control Register -------- */
#define MCAN_CCCR_INIT_Pos                    _U_(0)                                               /**< (MCAN_CCCR) Initialization (read/write) Position */
#define MCAN_CCCR_INIT_Msk                    (_U_(0x1) << MCAN_CCCR_INIT_Pos)                     /**< (MCAN_CCCR) Initialization (read/write) Mask */
#define MCAN_CCCR_INIT(value)                 (MCAN_CCCR_INIT_Msk & ((value) << MCAN_CCCR_INIT_Pos))
#define   MCAN_CCCR_INIT_DISABLED_Val         _U_(0x0)                                             /**< (MCAN_CCCR) Normal operation.  */
#define   MCAN_CCCR_INIT_ENABLED_Val          _U_(0x1)                                             /**< (MCAN_CCCR) Initialization is started.  */
#define MCAN_CCCR_INIT_DISABLED               (MCAN_CCCR_INIT_DISABLED_Val << MCAN_CCCR_INIT_Pos)  /**< (MCAN_CCCR) Normal operation. Position  */
#define MCAN_CCCR_INIT_ENABLED                (MCAN_CCCR_INIT_ENABLED_Val << MCAN_CCCR_INIT_Pos)   /**< (MCAN_CCCR) Initialization is started. Position  */
#define MCAN_CCCR_CCE_Pos                     _U_(1)                                               /**< (MCAN_CCCR) Configuration Change Enable (read/write, write protection) Position */
#define MCAN_CCCR_CCE_Msk                     (_U_(0x1) << MCAN_CCCR_CCE_Pos)                      /**< (MCAN_CCCR) Configuration Change Enable (read/write, write protection) Mask */
#define MCAN_CCCR_CCE(value)                  (MCAN_CCCR_CCE_Msk & ((value) << MCAN_CCCR_CCE_Pos))
#define   MCAN_CCCR_CCE_PROTECTED_Val         _U_(0x0)                                             /**< (MCAN_CCCR) The processor has no write access to the protected configuration registers.  */
#define   MCAN_CCCR_CCE_CONFIGURABLE_Val      _U_(0x1)                                             /**< (MCAN_CCCR) The processor has write access to the protected configuration registers (while MCAN_CCCR.INIT = '1').  */
#define MCAN_CCCR_CCE_PROTECTED               (MCAN_CCCR_CCE_PROTECTED_Val << MCAN_CCCR_CCE_Pos)   /**< (MCAN_CCCR) The processor has no write access to the protected configuration registers. Position  */
#define MCAN_CCCR_CCE_CONFIGURABLE            (MCAN_CCCR_CCE_CONFIGURABLE_Val << MCAN_CCCR_CCE_Pos) /**< (MCAN_CCCR) The processor has write access to the protected configuration registers (while MCAN_CCCR.INIT = '1'). Position  */
#define MCAN_CCCR_ASM_Pos                     _U_(2)                                               /**< (MCAN_CCCR) Restricted Operation Mode (read/write, write protection against '1') Position */
#define MCAN_CCCR_ASM_Msk                     (_U_(0x1) << MCAN_CCCR_ASM_Pos)                      /**< (MCAN_CCCR) Restricted Operation Mode (read/write, write protection against '1') Mask */
#define MCAN_CCCR_ASM(value)                  (MCAN_CCCR_ASM_Msk & ((value) << MCAN_CCCR_ASM_Pos))
#define   MCAN_CCCR_ASM_NORMAL_Val            _U_(0x0)                                             /**< (MCAN_CCCR) Normal CAN operation.  */
#define   MCAN_CCCR_ASM_RESTRICTED_Val        _U_(0x1)                                             /**< (MCAN_CCCR) Restricted operation mode active.  */
#define MCAN_CCCR_ASM_NORMAL                  (MCAN_CCCR_ASM_NORMAL_Val << MCAN_CCCR_ASM_Pos)      /**< (MCAN_CCCR) Normal CAN operation. Position  */
#define MCAN_CCCR_ASM_RESTRICTED              (MCAN_CCCR_ASM_RESTRICTED_Val << MCAN_CCCR_ASM_Pos)  /**< (MCAN_CCCR) Restricted operation mode active. Position  */
#define MCAN_CCCR_CSA_Pos                     _U_(3)                                               /**< (MCAN_CCCR) Clock Stop Acknowledge (read-only) Position */
#define MCAN_CCCR_CSA_Msk                     (_U_(0x1) << MCAN_CCCR_CSA_Pos)                      /**< (MCAN_CCCR) Clock Stop Acknowledge (read-only) Mask */
#define MCAN_CCCR_CSA(value)                  (MCAN_CCCR_CSA_Msk & ((value) << MCAN_CCCR_CSA_Pos))
#define MCAN_CCCR_CSR_Pos                     _U_(4)                                               /**< (MCAN_CCCR) Clock Stop Request (read/write) Position */
#define MCAN_CCCR_CSR_Msk                     (_U_(0x1) << MCAN_CCCR_CSR_Pos)                      /**< (MCAN_CCCR) Clock Stop Request (read/write) Mask */
#define MCAN_CCCR_CSR(value)                  (MCAN_CCCR_CSR_Msk & ((value) << MCAN_CCCR_CSR_Pos))
#define   MCAN_CCCR_CSR_NO_CLOCK_STOP_Val     _U_(0x0)                                             /**< (MCAN_CCCR) No clock stop is requested.  */
#define   MCAN_CCCR_CSR_CLOCK_STOP_Val        _U_(0x1)                                             /**< (MCAN_CCCR) Clock stop requested. When clock stop is requested, first INIT and then CSA will be set after all pend-ing transfer requests have been completed and the CAN bus reached idle.  */
#define MCAN_CCCR_CSR_NO_CLOCK_STOP           (MCAN_CCCR_CSR_NO_CLOCK_STOP_Val << MCAN_CCCR_CSR_Pos) /**< (MCAN_CCCR) No clock stop is requested. Position  */
#define MCAN_CCCR_CSR_CLOCK_STOP              (MCAN_CCCR_CSR_CLOCK_STOP_Val << MCAN_CCCR_CSR_Pos)  /**< (MCAN_CCCR) Clock stop requested. When clock stop is requested, first INIT and then CSA will be set after all pend-ing transfer requests have been completed and the CAN bus reached idle. Position  */
#define MCAN_CCCR_MON_Pos                     _U_(5)                                               /**< (MCAN_CCCR) Bus Monitoring Mode (read/write, write protection against '1') Position */
#define MCAN_CCCR_MON_Msk                     (_U_(0x1) << MCAN_CCCR_MON_Pos)                      /**< (MCAN_CCCR) Bus Monitoring Mode (read/write, write protection against '1') Mask */
#define MCAN_CCCR_MON(value)                  (MCAN_CCCR_MON_Msk & ((value) << MCAN_CCCR_MON_Pos))
#define   MCAN_CCCR_MON_DISABLED_Val          _U_(0x0)                                             /**< (MCAN_CCCR) Bus Monitoring mode is disabled.  */
#define   MCAN_CCCR_MON_ENABLED_Val           _U_(0x1)                                             /**< (MCAN_CCCR) Bus Monitoring mode is enabled.  */
#define MCAN_CCCR_MON_DISABLED                (MCAN_CCCR_MON_DISABLED_Val << MCAN_CCCR_MON_Pos)    /**< (MCAN_CCCR) Bus Monitoring mode is disabled. Position  */
#define MCAN_CCCR_MON_ENABLED                 (MCAN_CCCR_MON_ENABLED_Val << MCAN_CCCR_MON_Pos)     /**< (MCAN_CCCR) Bus Monitoring mode is enabled. Position  */
#define MCAN_CCCR_DAR_Pos                     _U_(6)                                               /**< (MCAN_CCCR) Disable Automatic Retransmission (read/write, write protection) Position */
#define MCAN_CCCR_DAR_Msk                     (_U_(0x1) << MCAN_CCCR_DAR_Pos)                      /**< (MCAN_CCCR) Disable Automatic Retransmission (read/write, write protection) Mask */
#define MCAN_CCCR_DAR(value)                  (MCAN_CCCR_DAR_Msk & ((value) << MCAN_CCCR_DAR_Pos))
#define   MCAN_CCCR_DAR_AUTO_RETX_Val         _U_(0x0)                                             /**< (MCAN_CCCR) Automatic retransmission of messages not transmitted successfully enabled.  */
#define   MCAN_CCCR_DAR_NO_AUTO_RETX_Val      _U_(0x1)                                             /**< (MCAN_CCCR) Automatic retransmission disabled.  */
#define MCAN_CCCR_DAR_AUTO_RETX               (MCAN_CCCR_DAR_AUTO_RETX_Val << MCAN_CCCR_DAR_Pos)   /**< (MCAN_CCCR) Automatic retransmission of messages not transmitted successfully enabled. Position  */
#define MCAN_CCCR_DAR_NO_AUTO_RETX            (MCAN_CCCR_DAR_NO_AUTO_RETX_Val << MCAN_CCCR_DAR_Pos) /**< (MCAN_CCCR) Automatic retransmission disabled. Position  */
#define MCAN_CCCR_TEST_Pos                    _U_(7)                                               /**< (MCAN_CCCR) Test Mode Enable (read/write, write protection against '1') Position */
#define MCAN_CCCR_TEST_Msk                    (_U_(0x1) << MCAN_CCCR_TEST_Pos)                     /**< (MCAN_CCCR) Test Mode Enable (read/write, write protection against '1') Mask */
#define MCAN_CCCR_TEST(value)                 (MCAN_CCCR_TEST_Msk & ((value) << MCAN_CCCR_TEST_Pos))
#define   MCAN_CCCR_TEST_DISABLED_Val         _U_(0x0)                                             /**< (MCAN_CCCR) Normal operation, MCAN_TEST register holds reset values.  */
#define   MCAN_CCCR_TEST_ENABLED_Val          _U_(0x1)                                             /**< (MCAN_CCCR) Test mode, write access to MCAN_TEST register enabled.  */
#define MCAN_CCCR_TEST_DISABLED               (MCAN_CCCR_TEST_DISABLED_Val << MCAN_CCCR_TEST_Pos)  /**< (MCAN_CCCR) Normal operation, MCAN_TEST register holds reset values. Position  */
#define MCAN_CCCR_TEST_ENABLED                (MCAN_CCCR_TEST_ENABLED_Val << MCAN_CCCR_TEST_Pos)   /**< (MCAN_CCCR) Test mode, write access to MCAN_TEST register enabled. Position  */
#define MCAN_CCCR_CME_Pos                     _U_(8)                                               /**< (MCAN_CCCR) CAN Mode Enable (read/write, write protection) Position */
#define MCAN_CCCR_CME_Msk                     (_U_(0x3) << MCAN_CCCR_CME_Pos)                      /**< (MCAN_CCCR) CAN Mode Enable (read/write, write protection) Mask */
#define MCAN_CCCR_CME(value)                  (MCAN_CCCR_CME_Msk & ((value) << MCAN_CCCR_CME_Pos))
#define   MCAN_CCCR_CME_ISO11898_1_Val        _U_(0x0)                                             /**< (MCAN_CCCR) CAN operation according to ISO11898-1 enabled  */
#define   MCAN_CCCR_CME_FD_Val                _U_(0x1)                                             /**< (MCAN_CCCR) CAN FD operation enabled  */
#define MCAN_CCCR_CME_ISO11898_1              (MCAN_CCCR_CME_ISO11898_1_Val << MCAN_CCCR_CME_Pos)  /**< (MCAN_CCCR) CAN operation according to ISO11898-1 enabled Position  */
#define MCAN_CCCR_CME_FD                      (MCAN_CCCR_CME_FD_Val << MCAN_CCCR_CME_Pos)          /**< (MCAN_CCCR) CAN FD operation enabled Position  */
#define MCAN_CCCR_CMR_Pos                     _U_(10)                                              /**< (MCAN_CCCR) CAN Mode Request (read/write) Position */
#define MCAN_CCCR_CMR_Msk                     (_U_(0x3) << MCAN_CCCR_CMR_Pos)                      /**< (MCAN_CCCR) CAN Mode Request (read/write) Mask */
#define MCAN_CCCR_CMR(value)                  (MCAN_CCCR_CMR_Msk & ((value) << MCAN_CCCR_CMR_Pos))
#define   MCAN_CCCR_CMR_NO_CHANGE_Val         _U_(0x0)                                             /**< (MCAN_CCCR) No mode change  */
#define   MCAN_CCCR_CMR_FD_Val                _U_(0x1)                                             /**< (MCAN_CCCR) Request CAN FD operation  */
#define   MCAN_CCCR_CMR_FD_BITRATE_SWITCH_Val _U_(0x2)                                             /**< (MCAN_CCCR) Request CAN FD operation with bit rate switching  */
#define   MCAN_CCCR_CMR_ISO11898_1_Val        _U_(0x3)                                             /**< (MCAN_CCCR) Request CAN operation according ISO11898-1  */
#define MCAN_CCCR_CMR_NO_CHANGE               (MCAN_CCCR_CMR_NO_CHANGE_Val << MCAN_CCCR_CMR_Pos)   /**< (MCAN_CCCR) No mode change Position  */
#define MCAN_CCCR_CMR_FD                      (MCAN_CCCR_CMR_FD_Val << MCAN_CCCR_CMR_Pos)          /**< (MCAN_CCCR) Request CAN FD operation Position  */
#define MCAN_CCCR_CMR_FD_BITRATE_SWITCH       (MCAN_CCCR_CMR_FD_BITRATE_SWITCH_Val << MCAN_CCCR_CMR_Pos) /**< (MCAN_CCCR) Request CAN FD operation with bit rate switching Position  */
#define MCAN_CCCR_CMR_ISO11898_1              (MCAN_CCCR_CMR_ISO11898_1_Val << MCAN_CCCR_CMR_Pos)  /**< (MCAN_CCCR) Request CAN operation according ISO11898-1 Position  */
#define MCAN_CCCR_FDO_Pos                     _U_(12)                                              /**< (MCAN_CCCR) CAN FD Operation (read-only) Position */
#define MCAN_CCCR_FDO_Msk                     (_U_(0x1) << MCAN_CCCR_FDO_Pos)                      /**< (MCAN_CCCR) CAN FD Operation (read-only) Mask */
#define MCAN_CCCR_FDO(value)                  (MCAN_CCCR_FDO_Msk & ((value) << MCAN_CCCR_FDO_Pos))
#define MCAN_CCCR_FDBS_Pos                    _U_(13)                                              /**< (MCAN_CCCR) CAN FD Bit Rate Switching (read-only) Position */
#define MCAN_CCCR_FDBS_Msk                    (_U_(0x1) << MCAN_CCCR_FDBS_Pos)                     /**< (MCAN_CCCR) CAN FD Bit Rate Switching (read-only) Mask */
#define MCAN_CCCR_FDBS(value)                 (MCAN_CCCR_FDBS_Msk & ((value) << MCAN_CCCR_FDBS_Pos))
#define MCAN_CCCR_TXP_Pos                     _U_(14)                                              /**< (MCAN_CCCR) Transmit Pause (read/write, write protection) Position */
#define MCAN_CCCR_TXP_Msk                     (_U_(0x1) << MCAN_CCCR_TXP_Pos)                      /**< (MCAN_CCCR) Transmit Pause (read/write, write protection) Mask */
#define MCAN_CCCR_TXP(value)                  (MCAN_CCCR_TXP_Msk & ((value) << MCAN_CCCR_TXP_Pos))
#define MCAN_CCCR_Msk                         _U_(0x00007FFF)                                      /**< (MCAN_CCCR) Register Mask  */


